#include <iostream>
#include <string>
#include "list.h"

// 1. Изменить значение фактического возврата
// 2. Удалить узлы где совпадают дата возврата и дата фактического фозврата
// 3. Определить колличество книг

int main()
{
    setlocale(0, "ru");
    int id;
    string date;
    Phonelist list;

    cout << "\n";
    list.AddTail("Война и мир", "01.02.2019", "01.03.2019", "01.04.2019");
    list.AddTail("Война и мир", "01.02.2019", "01.03.2019", "01.04.2019");
    list.AddTail("Война и мир", "01.02.2019", "01.03.2019", "01.04.2019");
    list.AddTail("Горе от ума", "01.02.2019", "01.03.2019", "01.03.2019");
    list.AddTail("Горе от ума", "01.02.2019", "01.03.2019", "01.03.2019");
    list.AddTail("Война и мир", "01.02.2019", "01.03.2019", "01.04.2019");
    list.AddTail("Война и мир", "01.02.2019", "01.03.2019", "01.04.2019");
    list.AddTail("Войн не мир", "01.02.2019", "01.03.2019", "01.04.2019");
    list.AddTail("Горе от ума", "01.02.2019", "01.03.2019", "01.03.2019");
    list.show();

    cout << "\n";
    cout << "Введите индекс ";
    cin >> id;
    cout << "Введите дату ";
    cin >> date;

    cout << "\n";
    list.change(id, date);
    list.show();
    cin >> date;

    cout << "\n";
    list.remove_same();

    cout << "\n";
    list.show();

    cout << "Всего книг " << list.GetCount();
}
